{
  "id": "asx-stock-analysis-goal",
  "name": "ASX Stock Analysis Goal Template",
  "type": "orchestrator_template",
  "description": "Reusable goal and tools for AI-powered ASX stock analysis",
  "template": {
    "thinking_level": "HIGH",
    "model_preference": "auto",
    "output_tags": ["stock-recommendation"],
    "output_schema_ref": "stock-report.schema.json",
    "available_tools": [
      {
        "name": "fetch_stock_data",
        "description": "Fetch ASX stock prices, historical data, and technical indicators. Creates document tagged with ['asx-stock-data', '<ticker>']. REQUIRED params: asx_code (string). OPTIONAL: period (string) - M1, M3, M6, Y1, Y2, Y5 (default Y1). Use period=Y5 for 5-year historical analysis. Provides: current price, OHLCV history, SMA20/50/200, RSI14, support/resistance, period performance (7D, 1M, 3M, 6M, 1Y, 2Y returns).",
        "worker": "asx_stock_data"
      },
      {
        "name": "fetch_announcements",
        "description": "Fetch official ASX company announcements with price sensitivity flags. Creates document tagged with ['asx-announcement', '<ticker>']. REQUIRED params: asx_code (string). OPTIONAL: period (string) - D1, W1, M1, M3, M6, Y1, Y5 (default Y1), limit (int) - max announcements. Use for FY/HY results, trading updates, contracts. Each announcement includes: date, headline, type, price_sensitive flag, PDF link.",
        "worker": "asx_announcements"
      },
      {
        "name": "fetch_index_data",
        "description": "Fetch ASX index data for benchmarks (XJO, XSO). Creates document tagged with ['asx-index', '<code>', 'benchmark']. REQUIRED params: asx_code (string) - e.g. 'XJO', 'XSO'. Provides: current value, period performance, OHLCV history, technicals.",
        "worker": "asx_stock_data"
      },
      {
        "name": "search_web",
        "description": "Search web for financial news, analyst reports, and company research. Creates document tagged with ['web-search']. REQUIRED params: query (string). Use for: analyst coverage, broker notes, news, historical financial data (revenue/profit history), competitor analysis. Useful for data not available from ASX APIs.",
        "worker": "web_search"
      },
      {
        "name": "analyze_summary",
        "description": "Generate deep LLM-based analysis from collected documents. REQUIRED params: prompt (string) - detailed analysis instructions, filter_tags (array) - tags to filter documents. OPTIONAL: thinking_level (string) - LOW or HIGH (use HIGH for complex analysis like FY results deep dive, signal/noise rating), schema_ref (string) - external schema file for structured output. For stock data use ['asx-stock-data', '<ticker>'], for announcements use ['asx-announcement', '<ticker>'].",
        "worker": "summary"
      }
    ],
    "goal": "Perform a comprehensive daily analysis of all ASX stocks in the variables list.\n\n=== PHASE 1: DATA COLLECTION (for EACH stock) ===\n\n1. STOCK DATA: Fetch current market data with 5-year history\n   - Use fetch_stock_data with period: Y5 for 5-year historical data\n   - Captures: prices, volume, technical indicators, period performance\n\n2. ANNOUNCEMENTS: Fetch 1-year of ASX announcements\n   - Use fetch_announcements with period: Y1 (or M6 for recent focus)\n   - Captures: all official ASX announcements with price sensitivity flags\n\n3. NEWS: Search for financial news and analyst coverage\n   - Use search_web for recent news, analyst reports, broker notes\n\n4. BENCHMARK DATA:\n   - Fetch ASX 200 (XJO) for market comparison\n\n=== PHASE 2: DEEP ANALYSIS ===\n\n5. ANNOUNCEMENT SIGNAL VS NOISE ANALYSIS\n   For each announcement, rate its information value:\n   - HIGH SIGNAL: Material financial data (FY/HY results, earnings guidance, major contracts, M&A)\n   - MEDIUM SIGNAL: Operational updates, board changes, strategy updates\n   - LOW SIGNAL (NOISE): Generic PR, routine notices, administrative filings\n   Cross-reference price-sensitive flags and stock price movement on announcement dates.\n   Calculate signal-to-noise ratio for the company's communication style.\n\n6. FY/HY RESULTS DEEP DIVE\n   Locate the most recent FY or HY results announcement and analyze:\n   - KEY POSITIVES (list 3-5): Revenue growth, margin improvement, cash flow, strategic wins\n   - KEY NEGATIVES (list 3-5): Cost pressures, debt levels, market headwinds, execution risks\n   - YEAR-OVER-YEAR COMPARISON: Revenue, NPAT, EPS, dividend changes\n   - MANAGEMENT OUTLOOK: Guidance, tone, and confidence level\n   - MARKET REACTION: Share price movement following announcement\n     * Day 1: +/-X% (immediate reaction)\n     * Week 1: +/-X% (did reaction sustain or fade?)\n     * Assessment: Was reaction proportionate to news quality?\n\n6b. PRICE EVENT ANALYSIS\n   Identify the 3-5 most significant share price movements in the past year:\n   - For each major move (+/-10% or more in a week):\n     * DATE: When did it occur?\n     * MOVE: +/-X% over how many days?\n     * CATALYST: What news/announcement triggered it? (if identifiable)\n     * MARKET REACTION ASSESSMENT:\n       - JUSTIFIED: Reaction proportionate to news significance\n       - OVERREACTION: Price moved more than fundamentals warrant\n       - UNDERREACTION: Price moved less than news significance suggests\n       - KNEE-JERK: Initial spike/drop that reversed within days\n     * CURRENT STATUS: Has the move held, reversed, or continued?\n\n7. 5-YEAR COMPANY PERFORMANCE ANALYSIS\n   Using historical stock data, analyze long-term trajectory:\n   - STOCK PRICE PROGRESSION: 5-year CAGR, key inflection points\n   - PERFORMANCE PHASES: Growth periods, consolidation, declines\n   - PRICE VS MARKET: Performance vs ASX 200 (XJO) benchmark\n   - VOLUME TRENDS: Institutional interest changes over time\n   Note: Revenue/profit progression requires web search for historical financials.\n\n8. COMPANY QUALITY ASSESSMENT\n   Rate overall company quality (A/B/C/D/F) based on fundamental strength:\n   - REVENUE TRAJECTORY: Growing, stable, or declining over 3-5 years\n   - PROFIT TRAJECTORY: NPAT/margin trends, path to profitability\n   - SHARE PRICE TRAJECTORY: Long-term capital appreciation vs destruction\n   - QUALITY SCORE: A (excellent fundamentals), B (good), C (average), D (weak), F (poor/speculative)\n\n   QUALITY REASONING (REQUIRED):\n   Provide 2-3 sentences explaining WHY this company received its quality rating.\n   Reference specific metrics: revenue growth %, profit margins, debt levels, share price CAGR.\n   Example: \"Quality B: Revenue grew 12% YoY with improving margins (8% to 11%), but high\n   debt-to-equity (1.4x) and recent share price weakness (-15% vs XJO +8%) limit the rating.\"\n\n9. STOCK SUMMARY with key metrics and technical levels\n\n10. DUAL INVESTMENT RECOMMENDATIONS\n\n   TRADER RECOMMENDATION (1-6 week horizon):\n   - Focus: Technical momentum, short-term catalysts, volatility\n   - Weighting: 70% technicals, 20% near-term catalysts, 10% fundamentals\n   - Action: STRONG BUY / BUY / HOLD / SELL / STRONG SELL\n   - Conviction: 1-10 score\n   - Key triggers: Breakout levels, earnings dates, news catalysts\n   - Suitable for: Active traders seeking short-term gains\n\n   SUPER RECOMMENDATION (6-12+ month horizon):\n   - Focus: Company quality, long-term value, sustainable growth\n   - Weighting: 60% fundamentals/quality, 25% industry position, 15% technicals\n   - Action: ACCUMULATE / HOLD / REDUCE / AVOID\n   - Conviction: 1-10 score\n   - Quality requirement: ONLY recommend ACCUMULATE for Quality A or B companies\n   - For Quality C: Maximum recommendation is HOLD\n   - For Quality D/F: Recommend REDUCE or AVOID regardless of technicals\n   - Suitable for: SMSF, long-term investors, retirement portfolios\n\n=== PHASE 3: SYNTHESIS ===\n\nIf data collection fails for any stock:\n- Note the failure explicitly\n- Attempt alternative data sources (web search)\n- Continue with remaining stocks\n\nFINAL OUTPUT MUST INCLUDE:\n- Individual stock reports with all analysis sections above\n- Summary table: Ticker | Name | Quality | Trader Rec | Trader Conv | Super Rec | Super Conv | Signal:Noise | 5Y CAGR\n- Alerts for significant price movements or material announcements\n- Overall watchlist assessment\n- TRADER WATCHLIST: Stocks with momentum for short-term opportunities\n- SUPER ACCUMULATE LIST: Quality A/B companies suitable for long-term investment\n- DEFINITIONS (at end of report):\n  * Quality Rating (A/B/C/D/F): Company fundamental strength grade\n    - A (Excellent): Consistent revenue AND profit growth, share price appreciation, strong balance sheet\n    - B (Good): Mostly positive trends with minor concerns\n    - C (Average): Mixed results, some growth but also challenges\n    - D (Weak): Declining trends in multiple areas, turnaround needed\n    - F (Speculative): Pre-revenue, high-risk, or deteriorating fundamentals\n  * Signal:Noise Ratio: Quality of company communications to ASX\n    - HIGH (>70%): Most announcements contain material, actionable information\n    - MEDIUM (40-70%): Mix of material updates and routine notices\n    - LOW (<40%): Mostly routine/PR announcements with little investment substance\n  * CAGR (Compound Annual Growth Rate): Annualized return over a period\n    - Formula: (End Value / Start Value)^(1/Years) - 1\n    - Example: 5Y CAGR of 15% = 15% average annual return compounded over 5 years\n    - Interpretation: >15% excellent, 10-15% good, 5-10% average, <5% poor"
  }
}
